# MEPAnalytical Segment Get Flow Characteristics Method

Source: https://www.revitapidocs.com/2026/b222de32-788b-c575-a42a-a28e1bbd1e47.htm

---

| MEPAnalytical Segment Get Flow Characteristics Method |
| --- |

Gets all flow characteristics of the segment.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public string GetFlowCharacteristics(
	Document doc
)
```

```
Public Function GetFlowCharacteristics (
	doc As Document
) As String
```

```
public:
String^ GetFlowCharacteristics(
	Document^ doc
)
```

```
member GetFlowCharacteristics :
        doc : Document -> string
```

#### Parameters

doc Document
:   The document of this segment.

#### Return Value

String
All flow characteristics of the segment in one string, empty if all characteristics are undefined. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

MEPAnalyticalSegment Class Autodesk.Revit.DB.Analysis Namespace